Repository: arsenik2/xlf-translator
Catalog: src/locale/messages/messages.*.xlf
Languages: nl

source: My statement
nl: Mijn statement

source: Last name:
nl: Achternaam:

source: Send
nl: Sturen

source: Bridget Cuevas (USA 1990) lives and works in The Hague, Netherlands. She is an acrylic abstract painter applying lines through the use of tape, rulers, and the appropriation of found color pallets. These tools imitate precision, thereon placating the balance between head and hand. In consequence, allowing a forethoughtful process to yield antidotal ease, as well as advocate for the confidence to condemn the importance of perfection. Cuevas holds a B.A in Art Practice with Highest Distinction and Departmental Honors from The University of California, Berkeley.
nl: Bridget Cuevas (VS 1990) woont en werkt in Den Haag, Nederland. Ze is een acryl abstracte schilder die lijnen toepast door het gebruik van tape, linialen en de toe-eigening van gevonden kleurenpallets. Deze gereedschappen imiteren precisie, waarna de balans tussen hoofd en hand wordt gepositioneerd. Het gevolg is dat een voorzichtig proces leidt tot een afkeer van het antidotum, en pleit voor het vertrouwen om het belang van perfectie te veroordelen. Cuevas heeft een B.A in Art Practice met het hoogste onderscheid en afdelingsprijzen van de University of California, Berkeley.

source: Education
nl: Onderwijs

source: b.1990 Anaheim, California
nl: b.1990 Anaheim, Californië

source: 2015 “Junction”, The Worth Ryder Art Gallery, Berkeley, California
nl: 2015 "Junction", The Worth Ryder Art Gallery, Berkeley, Californië

source: Message:
nl: Bericht:

source: Statement
nl: Mijn statement

source: First name:
nl: Voornaam:

source: Contact me
nl: Neem contact met mij op

source: 2016 B.A. in Art Practice with Highest Distinction and Departmental Honors, University of California, Berkeley
nl: 2016 B.A. in Art Practice met het hoogste onderscheid en afdelingsprijzen, University of California, Berkeley

source: 2016 "36 Artists in 3 Rooms, Senior Thesis", Worth Ryder Art Gallery, Berkeley, California
nl: 2016 "36 Artists in 3 Rooms, Senior Thesis", Worth Ryder Art Gallery, Berkeley, Californië

source: 2016 "Embody, NIAD Art Fair", NIAD Art Center, Richmond, California
nl: 2016 "Embody, NIAD Art Fair", NIAD Art Center, Richmond, Californië

source: 2015 “I’m Melting, California”, Wurster Courtyard, Berkeley, California
nl: 2015 "I'm Melting, California", Wurster Courtyard, Berkeley, Californië

source: 2014 A.A in Liberal Studies, Saddle Back College, Mission Viejo, California
nl: 2014 A.A in Liberal Studies, Saddleback College, Mission Viejo, Californië

source: Currently living and working in The Hague, Netherlands
nl: Momenteel woon en werk in Den Haag, Nederland

source: Paint
nl: Schilderij

source: 2015 “Terminal”, Artist Television Access, San Francisco, California
nl: 2015 "Terminal", Artist Television Access, San Francisco, Californië

source: Group Exhibitions
nl: Groepstentoonstellingen

source: 2015 "Grizzly Bay Film and Arts Festival", Banatao Auditorium, Berkeley, California
nl: 2015 "Grizzly Bay Film and Arts Festival", Banatao Auditorium, Berkeley, Californië

source: 2015 “IKWYDLS”, The Worth Ryder Art Gallery, Berkeley, California
nl: 2015 "IKWYDLS", The Worth Ryder Art Gallery, Berkeley, Californië

source: 2015 “Oh Dolly, Allopatry, They See Me Rollin”, The Worth Ryder Art Gallery, Berkeley, California
nl: 2015 "Oh Dolly, Allopatry, They See Me Rollin", The Worth Ryder Art Gallery, Berkeley, Californië

source: 2016 "Pick Your Poison, Honors Exhibition", Worth Ryder Art Gallery, Berkeley, California
nl: 2016 "Pick Your Poison, Honours Exhibition", Worth Ryder Art Gallery, Berkeley, Californië

source: Your first name
nl: Uw voornaam

source: Developed by
nl: Ontwikkeld door

source: Your last name
nl: Uw achternaam

source: Your email please
nl: Uw e-mail

source: Your message please
nl: Uw bericht
